# Задание № 1

# Найдите собственные векторы и собственные значения для линейного оператора, заданного матрицей:
#
# A=\begin{pmatrix}
# -1  -6\\
# 2  6
# \end{pmatrix}.

# Решение

# Загрузим модуль numpy и решим задачу

import numpy as np

a = np.array([[-1, -6], [2, 6]])
w, v = np.linalg.eig(a)

print(f'Матрица A:\n{a}')
print(f'Собственные значения:\n{w}')
print(f'Собственные векторы:\n{v}')

# Задание № 2

# Дан оператор поворота на 180 градусов, задаваемый матрицей:
#
# A=\begin{pmatrix}
# -1  0\\
# 0  -1
# \end{pmatrix}.
#
# Покажите, что любой вектор считается для него собственным.

# Решение
# \begin{vmatrix}
# 1-\lambda & 1\\
# 0 & 1-\lambda
# \end{vmatrix} = 0

# (1-\lambda)^{2}=0
# \lambda^{2}+2\lambda+1=0
# D=2^{2}-4*1*1=0
# \lambda=-2/2=-1

# Решаю по аналогу примера методичке:
# Найдём собственные векторы вида \begin{pmatrix}
# x_{1}\\
# x_{2}
# \end{pmatrix}, подставив полученное собственное значение в выражение \textbf{A}x=\lambda x:

# \begin{pmatrix}
# 1  1\\
# 0  1
# \end{pmatrix}
# \begin{pmatrix}
# x_{1}\\
# x_{2}
# \end{pmatrix}=
# \lambda
# \begin{pmatrix}
# x_{1}\\
# x_{2}
# \end{pmatrix}.

# Получим

# \begin{cases}
# -1\cdot x_{1}+0\cdot x_{2}= -1\cdot x_{1}, \\
# 0\cdot x_{1}+-1\cdot x_{2}= -1\cdot x_{2}.
# \end{cases}

# По большому счету мы должны перенести все в левую часть,
# но я особо не понял в итоге в какую часть перенеслось.
# Но судя методичке получим систему следующего вида:

# \begin{cases}
# -x_{1}=-x_{1}, \\
# -x_{2} = -x_{2}.
# \end{cases}

# \begin{cases}
# 0=0, \\
# 0=0.
# \end{cases}

# Следовательно, любой вектор является для данного оператора поворота будет собственным

# Задание № 3

# Пусть линейный оператор задан матрицей:
#
# A=\begin{pmatrix}
# 1  1\\
# -1  3
# \end{pmatrix}.
#
# Установите, считается ли вектор x=(1,1) собственным вектором этого линейного оператора.

# Предположим, что вектор x является собственным вектором заданного линейного оператора, тогда должно существовать некоторое вещественное число lambda, при котором

# \begin{pmatrix} 1  1\\ -1  3\end{pmatrix}\begin{pmatrix} 1\\ 1\end{pmatrix}=\lambda\begin{pmatrix} 1\\ 1\end{pmatrix}

# Из этого будет следовать, что

# \Rightarrow
# \begin{cases}
# 1+1\lambda\\
# -1+3\lambda\\
# \end{cases}
# \Rightarrow
# \begin{cases}
# \lambda=2\\
# \lambda=2
# \end{cases}
# Таким образом, вектор x=(1,1) является собственным вектором линейного оператора, заданного матрицей A.

# Задача № 4

# 